Config/InformationRegisters/BreakDownListSettings.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>BreakDownListSettings</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Item</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Services</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>BreakdownListFormula</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BreakdownListFormulas</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IsTax</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>VATRate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PriceCalculationFormula</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Quantity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>7</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>QuantityCalculationFormula</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>QuantityCalculationRule</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.QuantityCalculationRules</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ServiceDateShift</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ServiceDateNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IsInRoomRevenue</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IsNotInForecast</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Service</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Services</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>RoomRateType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RoomRateTypes</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>RoomRate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RoomRates</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>RoomType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RoomTypes</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AccommodationType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AccommodationTypes</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>RuleNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/BreakDownListSettings/Forms/tcRecordForm/Ext/Form/Module.bsl
#Region FormEventHandlers

// --------------------------------------------------------------------------------
&AtServer
Procedure OnCreateAtServer(pCancel, pStandardProcessing)
	If Not cmCheckUserPermissions("HavePermissionToManagePrices") Then
		ReadOnly = True;
	EndIf;
	If ValueIsFilled(Record.BreakdownListFormula) Then
		Items.GroupFormulaParameters.Enabled = False;
	Else
		Items.GroupFormulaParameters.Enabled = True;
	EndIf;
	IsTaxAppearance();
	IsInRoomRevenueAppearance();
EndProcedure // OnCreateAtServer

// --------------------------------------------------------------------------------
&AtClient
Procedure AfterWrite(pWriteParameters)
	Notify("BreakDownListSettings.Update", , ThisObject);
EndProcedure // AfterWrite

#EndRegion

#Region FormHeaderItemsEventHandlers

// --------------------------------------------------------------------------------
&AtClient
Procedure PriceOnChange(pItem)
	PriceOnChangeAtServer();
EndProcedure // PriceOnChangeAtServer

// --------------------------------------------------------------------------------
&AtClient
Procedure ItemOnChange(pItem)
	ItemOnChangeAtServer();
EndProcedure // ItemOnChange

// --------------------------------------------------------------------------------
&AtClient
Procedure BreakdownListFormulaOnChange(pItem)
	BreakdownListFormulaOnChangeAtServer();
EndProcedure // BreakdownListFormulaOnChange

// --------------------------------------------------------------------------------
&AtClient
Procedure IsTaxOnChange(pItem)
	IsTaxAppearance();
EndProcedure // IsTaxOnChange

// --------------------------------------------------------------------------------
&AtClient
Procedure IsInRoomRevenueOnChange(pItem)
	IsInRoomRevenueAppearance();
EndProcedure // IsInRoomRevenueOnChange

// --------------------------------------------------------------------------------
&AtClient
Procedure IsNotInForecastOnChange(pItem)
	IsInRoomRevenueAppearance();
EndProcedure // IsNotInForecastOnChange

#EndRegion

#Region Private

// --------------------------------------------------------------------------------
&AtServer
Procedure PriceOnChangeAtServer()
	If Record.Price <> 0 And Not ValueIsFilled(Record.Currency) Then
		If ValueIsFilled(Record.Hotel) Then
			Record.Currency = Record.Hotel.BaseCurrency;
		EndIf;
		If ValueIsFilled(SessionParameters.CurrentHotel) Then
			Record.Currency = SessionParameters.CurrentHotel.BaseCurrency;
		EndIf;
	EndIf;
EndProcedure // PriceOnChangeAtServer

// --------------------------------------------------------------------------------
&AtServer
Procedure ItemOnChangeAtServer()
	Items.GroupFormulaParameters.Enabled = False;
	If ValueIsFilled(Record.Item) Then
		If ValueIsFilled(Record.Item.BreakdownListFormula) Then
			Record.BreakdownListFormula = Record.Item.BreakdownListFormula;
		Else
			If Not ValueIsFilled(Record.BreakdownListFormula) Then
				Items.GroupFormulaParameters.Enabled = True;
			EndIf;
		EndIf;
	Else
		If Not ValueIsFilled(Record.BreakdownListFormula) Then
			Items.GroupFormulaParameters.Enabled = True;
		EndIf;
	EndIf;
EndProcedure // ItemOnChangeAtServer()

// --------------------------------------------------------------------------------
&AtServer
Procedure BreakdownListFormulaOnChangeAtServer()
	If ValueIsFilled(Record.BreakdownListFormula) Then
		Items.GroupFormulaParameters.Enabled = False;
	Else
		Items.GroupFormulaParameters.Enabled = True;
	EndIf;
EndProcedure // BreakdownListFormulaOnChangeAtServer()

// --------------------------------------------------------------------------------
&AtServer
Procedure IsTaxAppearance()
	If Record.IsTax Then
		Items.VATRate.Enabled = False;
		If ValueIsFilled(Record.VATRate) Then
			Record.VATRate = Undefined;
		EndIf;
	Else
		Items.VATRate.Enabled = True;
	EndIf;
EndProcedure // IsTaxAppearance

// --------------------------------------------------------------------------------
&AtServer
Procedure IsInRoomRevenueAppearance()
	If Not Record.IsInRoomRevenue Then
		Items.IsNotInForecast.Enabled = False;
		If Record.IsNotInForecast Then
			Record.IsNotInForecast = False;
		EndIf;
	Else
		Items.IsNotInForecast.Enabled = True;
	EndIf;
EndProcedure // IsInRoomRevenueAppearance

#EndRegion
